# Pandas DataFrame

In [42]:
import pandas as pd

## Lord the data from excel file

In [43]:
d = pd.read_excel("Data.xlsx")

In [44]:
d

     name  maths  english  science  history
0  ruwan      20       60       44       96
1   akila     25       50       55       65
2  sarath     80       60       70       39
3   nizan     50       38       89       53

In [45]:
df = pd.DataFrame(d)

In [46]:
df

     name  maths  english  science  history
0  ruwan      20       60       44       96
1   akila     25       50       55       65
2  sarath     80       60       70       39
3   nizan     50       38       89       53

In [47]:
type(df)

pandas.core.frame.DataFrame

## Lord the data from csv file

In [48]:
d1 = pd.read_csv("Data.csv")

In [49]:
d1

     name  maths  english  science  history
0  ruwan      20       60       44       96
1   akila     25       50       55       65
2  sarath     80       60       70       39
3   nizan     50       38       89       53

In [50]:
df1 = pd.DataFrame(d1)

In [51]:
df1

     name  maths  english  science  history
0  ruwan      20       60       44       96
1   akila     25       50       55       65
2  sarath     80       60       70       39
3   nizan     50       38       89       53

In [52]:
type(df1)

pandas.core.frame.DataFrame

## Creating DataFrame using Dictionary

In [56]:
mydict = {"name":["ruwan","akila","dean"],"maths":[20,50,48],"english":[80,60,98]}

In [57]:
df2 = pd.DataFrame(mydict)

In [58]:
df2

    name  maths  english
0  ruwan     20       80
1  akila     50       60
2   dean     48       98

## Creating DataFrame using list of Tuples

In [69]:
# In order to make DataFrame we need to create records and column names

records = [ ("ruwan",20,80),
    ("akila",50,60),
    ("dean",48,98)   ]

columns = ["name","maths","english"]

### FIrst method

In [66]:
df3 = pd.DataFrame(data=records,columns=columns)

In [67]:
df3

    name  maths  english
0  ruwan     20       80
1  akila     50       60
2   dean     48       98

### Second method

In [71]:
df4 = pd.DataFrame.from_records(data=records,columns=columns)

In [72]:
df4

    name  maths  english
0  ruwan     20       80
1  akila     50       60
2   dean     48       98

## Creating DataFrame using list of dictionaries

In [74]:
# In order to make DataFrame we need to make a list of dictionaries

marks = [ 

{'name':'ruwan','maths':20,'english':80},
{'name':'akila','maths':50,'english':60},
{'name':'dean','maths':48,'english': 98}   ]

In [76]:
df5 = pd.DataFrame(marks)

In [77]:
df5

    name  maths  english
0  ruwan     20       80
1  akila     50       60
2   dean     48       98